# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireTypeSet..::..Erase Method
WireTypeSet Class See Also
---
Removes a specified wire type from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	WireType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As WireType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	WireType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireTypeThe wire type to be erased.
# ### Return Value
The number of wire types that were erased from the set.
# See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace